tap "artginzburg/tap"
tap "homebrew/services"
tap "nicoverbruggen/cask"
tap "oven-sh/bun"
tap "schappim/ocr"
tap "shivammathur/extensions"
tap "shivammathur/php"

brew "act"
brew "artginzburg/tap/sudo-touchid"
brew "asciiquarium"
brew "coreutils"
brew "cowsay"
brew "dnsmasq"
brew "eza"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "mas"
brew "mkcert"
brew "mysql-client"
brew "nginx", restart_service: :changed
brew "nss"
brew "oven-sh/bun/bun"
brew "schappim/ocr/ocr"
brew "shivammathur/extensions/imagick@8.1"
brew "shivammathur/extensions/imagick@8.2"
brew "shivammathur/extensions/imagick@8.3"
brew "shivammathur/extensions/imagick@8.4"
brew "shivammathur/extensions/redis@8.1"
brew "shivammathur/extensions/redis@8.2"
brew "shivammathur/extensions/redis@8.3"
brew "shivammathur/extensions/redis@8.4"
brew "shivammathur/extensions/xdebug@8.2"
brew "shivammathur/extensions/xdebug@8.3"
brew "shivammathur/php/php"
brew "shivammathur/php/php@8.2"
brew "shivammathur/php/php@8.3"
brew "uv"
brew "webp"
brew "wget"
brew "xcodes", link: false
brew "yamlfmt"
brew "zsh-syntax-highlighting"

cask "bartender"
cask "chromedriver"
cask "cloudflare-warp"
cask "discord"
cask "docker-desktop"
cask "httpie-desktop"
cask "kap"
cask "numi"
cask "ray"
cask "rectangle"
cask "safari-technology-preview"
cask "slack"
cask "sonos"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"
cask "warp"
cask "xcodes-app"

mas "Blackmagic Disk Speed Test", id: 425264550
mas "DevUtils", id: 1533756032
mas "iStat Menus", id: 1319778037
mas "Ivory", id: 6444602274
mas "Little Snitch Mini", id: 1629008763
mas "Lungo", id: 1263070803
mas "Reeder Classic.", id: 1529448980
mas "Things 3", id: 904280696

vscode "ahmadalli.vscode-nginx-conf"
vscode "aswinkumar863.smarty-template-support"
vscode "austenc.laravel-blade-spacer"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "breezelin.phpstan"
vscode "dansysanalyst.pest-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "figma.figma-vscode-extension"
vscode "gruntfuggly.todo-tree"
vscode "heybourn.headwind"
vscode "jock.svg"
vscode "kasik96.latte"
vscode "lokalise.i18n-ally"
vscode "mblode.twig-language-2"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "octref.vetur"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "phproberto.vscode-php-getters-setters"
vscode "redhat.vscode-yaml"
vscode "ryannaddy.laravel-artisan"
vscode "samverschueren.linter-xo"
vscode "sanderronde.phpstan-vscode"
vscode "sburg.vscode-javascript-booster"
vscode "sdras.night-owl"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "xdebug.php-debug"
vscode "ziglang.vscode-zig"
